Revit 2016 API
ObjectFactory Constructor
 For Internal Use Only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public ObjectFactory()
Visual Basic
Public Sub New
Visual C++
public:
ObjectFactory()
Return Value
Remarks
 This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
ObjectFactory Class
Autodesk.Revit.DB Namespace